Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ПубликацииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПубликацииВебКабинетаСУ</name>
  <attributes>
    <name>АдресВебСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацийРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКабинета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКартинок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛоготипа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПользовательУказанВПубликацииИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНовостиСтарее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаПользователи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭлектронныхКурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСвободнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноВосстановлениеПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыВосстановленияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСтандартнаяАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияCAS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервисаCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенСписокОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенКалендарьОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытоеОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныРезультатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныСертификатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтатусОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаКарточкаОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалендаря</name>
    <type>
      <types>EnumRef.ВариантыКалендаряВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлементыБиблиотекиВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоличествоЭлементовРазделаБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРолиПреподавателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайнВМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПинКодыДляРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьАутентификациюПровайдераOpenIDПриВыходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоискПоЭлектроннымРесурсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенРазделПроверкиЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижнийКолонтитул</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйКаталогПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЕдинственнаяПубликацияВОбщемКаталоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>EnumRef.РедакцииВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикЯндексМетрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСервисаSentry</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСведенияВКонсоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеЧислоМинутНеактивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПинКодыНаГлавнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаСбораСтатистики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецЗаполненияПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазместитьСсылкуРегистрацииСверху</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьФотографиюПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьНастройкиРассылокВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаОтзывОтветаНаЗадание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеКомандыПрофиля</name>
    <type>
      <types>EnumRef.ВариантыОформленияКомандыПрофиляВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВКабинете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйСписокОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьПустыеПапкиБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПублично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПослеАвторизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляРегистрации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>EnumRef.ВидыПолейРегистрацииВебКабинетаСУО</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>EnumRef.ТипыПолейРегистрацииВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПолеПодтверждения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодтверждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКакЛогин</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияОтчетовВебКабинетаСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппировкиОбучений</name>
    <attributes>
      <name>Группировка</name>
      <type>
        <types>EnumRef.ГруппировкиОбученийВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_ru</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_en</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ЯзыкиВебКабинетаСУ/ЯзыкиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЯзыкиВебКабинетаСУ</name>
  <enumValues>
    <name>Авто</name>
  </enumValues>
  <enumValues>
    <name>ruRU</name>
  </enumValues>
  <enumValues>
    <name>enEN</name>
  </enumValues>
  <enumValues>
    <name>uaUA</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ЗаполнитьОбъектНачальнымиДанными(Объект) Экспорт
	
	// Настройки
	//
	
	Объект.Код = "v8cabinet_"+ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(ОбщегоНазначенияСУ.СлучайноеЧисло(1, 99999));	
	Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы = Истина;
	
	// Разделы
	//
	
	ЗаполнитьРазделыПоУмолчанию(Объект);
	ЗаполнитьПоляРегистрацииПоУмолчанию(Объект);
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО")
		ИЛИ ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР") Тогда
		
		Объект.ИспользоватьПинКодыДляРегистрации = Ложь;
		Объект.ПоказатьПинКодыНаГлавнойСтранице = Ложь;
		Объект.ПоказыватьРолиПреподавателей = Ложь;
		Объект.ДоступенКалендарьОбучения = Ложь;
		Объект.ДоступноОткрытоеОбучение = Ложь;
		Объект.ДоступныСертификатыОбучения = Ложь;
		
	КонецЕсли;
	
	//----------------------------------//
	
КонецПроцедуры

Процедура ЗаполнитьРазделыПоУмолчанию(Объект) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

	ЭтоОбразовательнаяОрганизация = ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО");
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	//----------------------------------//
	
	Объект.Разделы.Очистить();
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "brandList"; 
	НовыйРаздел.Имя = "";
	НовыйРаздел.Иконка = "fa fa-home fa-2x";
	НовыйРаздел.Страница = "index";
	НовыйРаздел.Якорь = "";
	НовыйРаздел.ДоступенПублично = Истина;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Ложь;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "navList"; 
	НовыйРаздел.Имя = ИмяРаздела("Learning", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "education";
	НовыйРаздел.Якорь = "/home";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Истина;
	
	Если ЭтоПолныйИнтерфейс Тогда
	
		НовыйРаздел = Объект.Разделы.Добавить();
		НовыйРаздел.Контейнер = "navList"; 
		НовыйРаздел.Имя = ИмяРаздела("Library", Объект.Язык);
		НовыйРаздел.Иконка = "";
		НовыйРаздел.Страница = "library";
		НовыйРаздел.Якорь = "/home";
		НовыйРаздел.ДоступенПублично = Ложь;
		НовыйРаздел.ДоступенПослеАвторизации = Истина;	
		НовыйРаздел.ПроверятьПрава = Истина;
	
	КонецЕсли;
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "navList"; 
	НовыйРаздел.Имя = ИмяРаздела("News", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "news";
	НовыйРаздел.Якорь = "";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Истина;	
	
	Если ЭтоОбразовательнаяОрганизация
		ИЛИ ЭтоПолныйИнтерфейс Тогда
		
		НовыйРаздел = Объект.Разделы.Добавить();
		НовыйРаздел.Контейнер = "navList"; 
		НовыйРаздел.Имя = ИмяРаздела("Forum", Объект.Язык);
		НовыйРаздел.Иконка = "";
		НовыйРаздел.Страница = "forum";
		НовыйРаздел.Якорь = "/home";
		НовыйРаздел.ДоступенПублично = Ложь;
		НовыйРаздел.ДоступенПослеАвторизации = Истина;
		НовыйРаздел.ПроверятьПрава = Истина;
		
	КонецЕсли;
		
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "navList"; 
	НовыйРаздел.Имя = ИмяРаздела("Messages", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "messages";
	НовыйРаздел.Якорь = "/inbox";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;	
	НовыйРаздел.ПроверятьПрава = Истина;	
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "navList"; 
	НовыйРаздел.Имя = ИмяРаздела("Contacts", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "users";
	НовыйРаздел.Якорь = "/default";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Истина;		
	
	//----------------------------------//
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "navList"; 
	НовыйРаздел.Имя = ИмяРаздела("Online resources", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "electronicResources";
	НовыйРаздел.Якорь = "";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Истина;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "rightList"; 
	НовыйРаздел.Имя = ИмяРаздела("Settings", Объект.Язык);
	НовыйРаздел.Иконка = "fa fa-user fa-2x";
	НовыйРаздел.Страница = "settings";
	НовыйРаздел.Якорь = "/info";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Ложь;
	
	//----------------------------------//
	
	НовыйРаздел = Объект.Разделы.Добавить();
	НовыйРаздел.Контейнер = "rightList"; 
	НовыйРаздел.Имя = ИмяРаздела("Exit", Объект.Язык);
	НовыйРаздел.Иконка = "";
	НовыйРаздел.Страница = "exit";
	НовыйРаздел.Якорь = "";
	НовыйРаздел.ДоступенПублично = Ложь;
	НовыйРаздел.ДоступенПослеАвторизации = Истина;
	НовыйРаздел.ПроверятьПрава = Ложь;	

	
КонецПроцедуры

Функция ПоляРегистрацииПоУмолчанию(Знач ЯзыкВебКабинета) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЯзыкВебКабинета)
		ИЛИ ЯзыкВебКабинета = Перечисления.ЯзыкиВебКабинетаСУ.Авто Тогда
		
		ЯзыкВебКабинета = Перечисления.ЯзыкиВебКабинетаСУ.ruRU;
		
	КонецЕсли;
	
	ПоляРегистрации = Новый ТаблицаЗначений;
	
	РеквизитыПолей = Метаданные.Справочники.ПубликацииВебКабинетаСУ.ТабличныеЧасти.ПоляРегистрации.Реквизиты;
	
	Для каждого РеквизитТЧ Из РеквизитыПолей Цикл	
		ПоляРегистрации.Колонки.Добавить(РеквизитТЧ.Имя, РеквизитТЧ.Тип, РеквизитТЧ.Синоним);	
	КонецЦикла;
	
	НовыйРаздел = ПоляРегистрации.Добавить();
	НовыйРаздел.Имя = Перечисления.ВидыПолейРегистрацииВебКабинетаСУО.LastName; 
	НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("Last Name", ЯзыкВебКабинета);
	НовыйРаздел.Обязательное = Истина;
	НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода;
	
	НовыйРаздел = ПоляРегистрации.Добавить();
	НовыйРаздел.Имя = Перечисления.ВидыПолейРегистрацииВебКабинетаСУО.FirstName; 
	НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("First Name", ЯзыкВебКабинета);
	НовыйРаздел.Обязательное = Истина;	
	НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода;
	
	НовыйРаздел = ПоляРегистрации.Добавить();
	НовыйРаздел.Имя = Перечисления.ВидыПолейРегистрацииВебКабинетаСУО.Patronymic; 
	НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("Patronymic", ЯзыкВебКабинета);
	НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода;
	
	НовыйРаздел = ПоляРегистрации.Добавить();
	НовыйРаздел.Имя = "Email"; 
	НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("Email", ЯзыкВебКабинета);
	НовыйРаздел.КонтактнаяИнформация = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	НовыйРаздел.Обязательное = Истина;
	НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ЭлектроннаяПочта;
	НовыйРаздел.ИспользоватьКакЛогин = Истина;
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда
		
		НовыйРаздел = ПоляРегистрации.Добавить();
		НовыйРаздел.Имя = "MobilePhone"; 
		НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("Mobile phone", ЯзыкВебКабинета);
		НовыйРаздел.КонтактнаяИнформация = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
		НовыйРаздел.Обязательное = Истина;
		НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода;
		
		ОбязательныеРеквизитыУЦ = УправлениеОбучениемСУО.ОбязательныеРеквизитыСлушателяУЦ();
		
		Для каждого СтрокаТОР Из ОбязательныеРеквизитыУЦ Цикл
		
			Если НЕ СтрокаТОР.Существует Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйРаздел = ПоляРегистрации.Добавить();
			НовыйРаздел.Имя = СтрокаТОР.ИмяПоляФормы; 
			НовыйРаздел.Наименование = НаименованиеРазделаРегистрации(СтрокаТОР.НаименованиеАнгл, ЯзыкВебКабинета);
			НовыйРаздел.Реквизит = СтрокаТОР.Ссылка;
			НовыйРаздел.Обязательное = Истина;
			НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ПолеВвода;
			
		КонецЦикла;

		
	КонецЕсли;
	
	//----------------------------------//
	
	НовыйРаздел = ПоляРегистрации.Добавить();
	НовыйРаздел.Имя = Перечисления.ВидыПолейРегистрацииВебКабинетаСУО.Password; 
	НовыйРаздел.Наименование = НаименованиеРазделаРегистрации("Password", ЯзыкВебКабинета);
	НовыйРаздел.ДобавлятьПолеПодтверждения = Истина;
	НовыйРаздел.Обязательное = Истина;
	НовыйРаздел.ТипПоля = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.Пароль;
	НовыйРаздел.НаименованиеПодтверждения = НаименованиеРазделаРегистрации("Confirm Password", ЯзыкВебКабинета);
			
	Возврат ПоляРегистрации;
	
КонецФункции

Процедура ЗаполнитьПоляРегистрацииПоУмолчанию(Объект) Экспорт
	
	ТаблицаПолей = ПоляРегистрацииПоУмолчанию(Объект.Язык);
	
	Объект.ПоляРегистрации.Загрузить(ТаблицаПолей);	
	
КонецПроцедуры

Функция ИмяРаздела(ИмяАнгл, ЯзыкКабинета)
	
	Если ЯзыкКабинета = Перечисления.ЯзыкиВебКабинетаСУ.enEN Тогда
		Возврат ИмяАнгл;
	Иначе
		Возврат ВебКабинетСУ.Перевод(ИмяАнгл, "РазделыВебКабинета", "EN", Перечисления.ЯзыкиВебКабинетаСУ.ПростойКодИзСоставного(ЯзыкКабинета));
	КонецЕсли;		
	
КонецФункции		

Функция НаименованиеРазделаРегистрации(НаименованиеАнгл, ЯзыкКабинета)
	
	Если ЯзыкКабинета = Перечисления.ЯзыкиВебКабинетаСУ.enEN Тогда
		Возврат НаименованиеАнгл;
	Иначе
		Возврат ВебКабинетСУ.Перевод(НаименованиеАнгл, "ПоляРегистрацииВебКабинета", "EN", Перечисления.ЯзыкиВебКабинетаСУ.ПростойКодИзСоставного(ЯзыкКабинета));
	КонецЕсли;		
	
КонецФункции

Процедура УстановитьНачальнуюДоступностьЭлементовФормыПубликации(Форма, Элементы) Экспорт
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступнаКарточкаОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ГруппаСкрыватьНовостиСтарее", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "АдресСервисаОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ГруппаКаталогФайлов", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенСписокОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенКалендарьОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступныРезультатыОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступныСертификатыОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступноОткрытоеОбучение", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьСтатусОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступнаКарточкаОбучения", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ВариантКалендаря", Ложь);
	
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаОбучение", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаНовости", Ложь);	
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаОбщение", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаБиблиотека", Ложь);	
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьПользователейОнлайн", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьПользователейОнлайнВМеню", Ложь);
	// ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ИспользоватьПинКодыДляРегистрации", Ложь);
	
	//----------------------------------//		
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	Если ПолучитьФункциональнуюОпцию("ОбразовательнаяОрганизацияОО")
		ИЛИ ПолучитьФункциональнуюОпцию("ЭкзаменаторЭР") Тогда
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ИспользоватьПинКодыДляРегистрации", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьРолиПреподавателей", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенКалендарьОбучения", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступноОткрытоеОбучение", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ВариантКалендаря", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаБиблиотека", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступныСертификатыОбучения", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ИспользоватьПинКодыВПерсональныхНастройках", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказатьПинКодыНаГлавнойСтранице", Ложь);
	КонецЕсли;
		
	//----------------------------------//
	
	Если Форма.Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ВариантКалендаря", Ложь);	
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаРазделы", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьПользователейОнлайн", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьПользователейОнлайнВМеню", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенПолныйКаталогПользователей", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаЭлектронныеРесурсы", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОткрыватьЭлементыБиблиотекиВНовомОкне", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенСписокОбучения", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьСтатусОбучения", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступнаКарточкаОбучения", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьРолиПреподавателей", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ВариантКалендаря", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказыватьКоличествоЭлементовРазделаБиблиотеки", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступныРезультатыОбучения", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ДоступенРазделПроверкиЗаданий", Ложь);
		
	КонецЕсли;
	
	Если Форма.Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "АдресКаталогаКартинок", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаИнтеграция", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "РазрешенноеЧислоМинутНеактивности", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ПоказатьПинКодыНаГлавнойСтранице", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ЧастотаСбораСтатистики", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "НаименованиеПоляИмя", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОписаниеПоляИмя", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОбразецЗаполненияПоляИмя", Ложь);
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ЗапретитьИзменятьФотографиюПрофиля", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ЗапретитьИзменятьНастройкиРассылокВПрофиле", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ГруппаОтзывЗадания", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ОформлениеКомандыПрофиля", Ложь);		
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СтраницаРазмещениеОтчетов", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "ГруппировкиОбучений", Ложь);
		ОбщегоНазначенияСУКлиентСервер.УстановитьВидимостьЭлементаФормы(Форма, "СкрыватьПустыеПапкиБиблиотеки", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлНастроек(Объект, УникальныйИдентификатор = Неопределено, ПутьДляЗаписи = Неопределено) Экспорт
	
	ТекстФайлаНастроек = ""; // Переменная формы
	
	// Настройки кабинета
	
	НастройкиКабинета = Новый Структура;
	
	НастройкиКабинета.Вставить("name", Объект.Код);
	НастройкиКабинета.Вставить("host", Объект.АдресВебСервера);
	НастройкиКабинета.Вставить("title", Объект.Наименование);	
	НастройкиКабинета.Вставить("basePortal", Объект.АдресПубликации);
	НастройкиКабинета.Вставить("baseDesktop", Объект.АдресКаталогаКабинета);
	НастройкиКабинета.Вставить("baseAdmin", Объект.АдресПубликацииИБ);
	НастройкиКабинета.Вставить("baseRes", Объект.АдресПубликацийРесурсов);
	НастройкиКабинета.Вставить("baseImages", Объект.АдресКаталогаКартинок);
	НастройкиКабинета.Вставить("baseFiles", Объект.АдресКаталогаФайлов);
	НастройкиКабинета.Вставить("startPage", Объект.СтартоваяСтраница);
	НастройкиКабинета.Вставить("sentry", Объект.ИдентификаторСервисаSentry);
	НастройкиКабинета.Вставить("yandexMetrika", Объект.СчетчикЯндексМетрики);
	НастройкиКабинета.Вставить("displayLog", Объект.ВыводитьСведенияВКонсоль);	
	НастройкиКабинета.Вставить("cookiesExpires", 7);	
	НастройкиКабинета.Вставить("idle", Объект.РазрешенноеЧислоМинутНеактивности);
	
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		НастройкиКабинета.Вставить("availablePinCodesOnStartPage", Объект.ПоказатьПинКодыНаГлавнойСтранице);
	КонецЕсли;

	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		ТаблицаРазделов = Новый ТаблицаЗначений;
		ТаблицаРазделов.Колонки.Добавить("container");
		ТаблицаРазделов.Колонки.Добавить("label");
		ТаблицаРазделов.Колонки.Добавить("icon");
		ТаблицаРазделов.Колонки.Добавить("page");
		ТаблицаРазделов.Колонки.Добавить("hash");
		ТаблицаРазделов.Колонки.Добавить("visibility");
		ТаблицаРазделов.Колонки.Добавить("verifyPermissions");
		ТаблицаРазделов.Колонки.Добавить("additionalPermissions");
			
		Для каждого Строка Из Объект.Разделы Цикл
		
			НоваяСтрока = ТаблицаРазделов.Добавить();	
			НоваяСтрока.container = Строка.Контейнер;
			НоваяСтрока.label = Строка.Имя;
			НоваяСтрока.icon = Строка.Иконка;
			НоваяСтрока.page = Строка.Страница;
			НоваяСтрока.hash = Строка.Якорь;
			НоваяСтрока.visibility = Новый Структура("public, private", Строка.ДоступенПублично, Строка.ДоступенПослеАвторизации);		
			НоваяСтрока.verifyPermissions = Строка.ПроверятьПрава;			
			НоваяСтрока.additionalPermissions = Новый Массив;
			
			Если Строка.Страница = "education" Тогда
				НоваяСтрока.additionalPermissions.Добавить("teaching");
			КонецЕсли;
			
		КонецЦикла;
		
		НастройкиКабинета.Вставить("navbar", ТаблицаРазделов);	
		
	КонецЕсли;
		
	НастройкиКабинета.Вставить("logo", Объект.АдресЛоготипа);
	Если ЗначениеЗаполнено(Объект.НижнийКолонтитул) Тогда
		НастройкиКабинета.Вставить("footer", Объект.НижнийКолонтитул);
	Иначе
		НастройкиКабинета.Вставить("footer", Метаданные.Справочники.ПубликацииВебКабинетаСУ.Реквизиты.НижнийКолонтитул.ЗначениеЗаполнения);
	КонецЕсли;
	
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		Язык = ?(ЗначениеЗаполнено(Объект.Язык) И Объект.Язык <> Перечисления.ЯзыкиВебКабинетаСУ.Авто,
			Объект.Язык, Перечисления.ЯзыкиВебКабинетаСУ.ruRU);
		НастройкиКабинета.Вставить("language", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Язык));
	Иначе
		Если ЗначениеЗаполнено(Объект.Язык) И Объект.Язык <> Перечисления.ЯзыкиВебКабинетаСУ.Авто Тогда
			НастройкиКабинета.Вставить("language", ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(Объект.Язык));
		Иначе
			НастройкиКабинета.Вставить("language", "");
		КонецЕсли;
	КонецЕсли;	
	
	НастройкиКабинетаJSON = ОбщегоНазначенияСУ.ДанныеВJSON(НастройкиКабинета);

	ТекстФайлаНастроек = ТекстФайлаНастроек + "
	|oSettingsPortal = " + НастройкиКабинетаJSON + ";";
	
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		
		ТекстФайлаНастроек = ТекстФайлаНастроек + "
			|oSettingsPortal.storageName = function (name) {
			|		return oSettingsPortal.name + ""_"" + name;
			|};";
		
	Иначе
		
		ПубликацияСтаройРедакции = Справочники.ПубликацииВебКабинетаСУ.ЕдинственнаяПубликацияВОбщемКаталоге(Перечисления.РедакцииВебКабинетаСУ.Редакция20);
		
		Если ЗначениеЗаполнено(ПубликацияСтаройРедакции) Тогда
			КодРедакции2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПубликацияСтаройРедакции, "Код");
			ТекстФайлаНастроек = ТекстФайлаНастроек + "
				|oSettingsPortal.storageName = function (name) {
				|		return """+ КодРедакции2 +""" + ""_"" + name;
				|};";
		Иначе
			ТекстФайлаНастроек = ТекстФайлаНастроек + "
				|oSettingsPortal.storageName = function (name) {
				|		return oSettingsPortal.name + ""_"" + name;
				|};";
		КонецЕсли;
		
	КонецЕсли;
	
		
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	// Настройки обучение
	
	НастройкиОбучения = Новый Структура;
	
	НастройкиОбучения.Вставить("url", Объект.АдресСервисаОбучения); 
	НастройкиОбучения.Вставить("user", ЛогинСлужебногоПользователя(Объект)); 
	НастройкиОбучения.Вставить("password", ПарольСлужебногоПользователя(Объект)); 
	
	НастройкиУчебныхАктивностей = Новый Структура;
	НастройкиУчебныхАктивностей.Вставить("availableDescriptionPage", Объект.ДоступнаКарточкаОбучения); 
	НастройкиУчебныхАктивностей.Вставить("availableActivePage", Объект.ДоступенСписокОбучения); 
	НастройкиУчебныхАктивностей.Вставить("availableCalendarPage", Объект.ДоступенКалендарьОбучения); 
	НастройкиУчебныхАктивностей.Вставить("openResInNewWindow", Объект.ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне); 
	НастройкиУчебныхАктивностей.Вставить("availableResultsPage", Объект.ДоступныРезультатыОбучения); 
	НастройкиУчебныхАктивностей.Вставить("availableCertificatesPage", Объект.ДоступныСертификатыОбучения); 
	НастройкиУчебныхАктивностей.Вставить("availableOpenEduPage", Объект.ДоступноОткрытоеОбучение); 
	НастройкиУчебныхАктивностей.Вставить("availableStatusActivities", Объект.ПоказыватьСтатусОбучения); 
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция20 Тогда
		НастройкиУчебныхАктивностей.Вставить("typeCalendar", Перечисления.ВариантыКалендаряВебКабинетаСУО.ПереводВарианта(Объект.ВариантКалендаря));
	КонецЕсли;
	НастройкиУчебныхАктивностей.Вставить("activeCalendar", Ложь); // Устарело (оставлено для совместимости)
	НастройкиУчебныхАктивностей.Вставить("displayTeachersRole", Объект.ПоказыватьРолиПреподавателей);
	НастройкиУчебныхАктивностей.Вставить("availableToCheckPage", Объект.ДоступенРазделПроверкиЗаданий);
	НастройкиУчебныхАктивностей.Вставить("timeToCancelTaskAnswer", Объект.ВремяНаОтзывОтветаНаЗадание);
		
	Если Объект.Редакция = Перечисления.РедакцииВебКабинетаСУ.Редакция30 Тогда
		
		НастройкиУчебныхАктивностей.Вставить("hideEmptyLibraryElements", Объект.СкрыватьПустыеПапкиБиблиотеки);
		
		ГруппировкиОбучений = Новый Структура("studentActivitiesFilters", Новый Массив);
		Для каждого СтрокаГО Из Объект.ГруппировкиОбучений Цикл
			Если НЕ СтрокаГО.Использовать Тогда
				Продолжить;
			КонецЕсли;			
			НоваяНастройкаГруппировки = Новый Структура("name, titles",
				Перечисления.ГруппировкиОбученийВебКабинетаСУО.ИмяГруппировкиДляНастройкиВебКабинета(СтрокаГО.Группировка),
				Новый Структура("en, ru", СтрокаГО.Наименование_en, СтрокаГО.Наименование_ru));
			ГруппировкиОбучений.studentActivitiesFilters.Добавить(НоваяНастройкаГруппировки);
		КонецЦикла;
		НастройкиУчебныхАктивностей.Вставить("filters", ГруппировкиОбучений);
		
	КонецЕсли;
	
	НастройкиНовостей = Новый Структура;
	НастройкиНовостей.Вставить("fromLastDays", Объект.СкрыватьНовостиСтарее);
	
	НастройкиКоммуникаций = Новый Структура;
	НастройкиКоммуникаций.Вставить("availableMessagesFromUserProfile", Объект.ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя);
	
	НастройкиБиблиотеки = Новый Структура;
	НастройкиБиблиотеки.Вставить("openItemsInNewWindow", Объект.ОткрыватьЭлементыБиблиотекиВНовомОкне);	
	НастройкиБиблиотеки.Вставить("displayCountItems", Объект.ПоказыватьКоличествоЭлементовРазделаБиблиотеки);		
	
	НастройкиСтраницыПользователей = Новый Структура;
	НастройкиСтраницыПользователей.Вставить("displayOnline", Объект.ПоказыватьПользователейОнлайн);	
	НастройкиСтраницыПользователей.Вставить("displayOnlineInMenu", Объект.ПоказыватьПользователейОнлайнВМеню);	
	
	НастройкиСтраницыПользователей.Вставить("disableProfilePhoto", Объект.ЗапретитьИзменятьФотографиюПрофиля);	
	НастройкиСтраницыПользователей.Вставить("disableProfileContacts", Объект.ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле);	
	НастройкиСтраницыПользователей.Вставить("disableProfileAdditional", Объект.ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле);	
	НастройкиСтраницыПользователей.Вставить("disableProfileNotice", Объект.ЗапретитьИзменятьНастройкиРассылокВПрофиле);	
	НастройкиСтраницыПользователей.Вставить("profileCommandVariant", Перечисления.ВариантыОформленияКомандыПрофиляВебКабинетаСУО.ЗначениеВТекст(Объект.ОформлениеКомандыПрофиля));	
	
	НастройкиКаталогаЭР = Новый Структура;
	НастройкиКаталогаЭР.Вставить("displaySearch", Объект.ИспользоватьПоискПоЭлектроннымРесурсам);	
	
	НастройкиОтчетов = Новый Структура;
	НастройкиОтчетов.Вставить("allocations", Новый Массив);
	НастройкиОтчетов.Вставить("formats", Новый Массив);
	
	Если Объект.ПодключитьОтчеты Тогда
	
		ВариантыРазмещенияОтчетов = Новый СписокЗначений;
		ВариантыРазмещенияОтчетов.Добавить(Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя, "teacherPage");
		ВариантыРазмещенияОтчетов.Добавить(Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя, "teacherActivityPage");
		
		Для каждого ВариантРазмещения Из ВариантыРазмещенияОтчетов Цикл
			
			ОтчетыВариантаРазмещения = Объект.РазмещениеОтчетов.НайтиСтроки(Новый Структура("Размещение", ВариантРазмещения.Значение));	
			
			Для каждого СтрокаТЧ Из ОтчетыВариантаРазмещения Цикл			
				ОписаниеОтчета = Новый Структура("allocation, id, title");
				ОписаниеОтчета.allocation = ВариантРазмещения.Представление;
				Если ЗначениеЗаполнено(СтрокаТЧ.Наименование) Тогда
					ОписаниеОтчета.title = СтрокаТЧ.Наименование;
				Иначе
					Если Объект.ДоступенПолныйСписокОтчетов Тогда
						ОписаниеОтчета.title = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Отчет, "Наименование");						
					Иначе
						ОписаниеОтчета.title = НаименованиеРекомендуемогоОтчета(СтрокаТЧ.Отчет, ВариантРазмещения.Значение);	
					КонецЕсли;
				КонецЕсли;				
				ОписаниеОтчета.id = СтрокаТЧ.Отчет;
				НастройкиОтчетов.allocations.Добавить(ОписаниеОтчета);
			КонецЦикла;		
			
		КонецЦикла;
		
		Если Объект.ДоступноОткрытиеОтчетаВФорматеPDF Тогда
			ОписаниеФорматаОтчета = Новый Структура("type", "PDF");
			НастройкиОтчетов.formats.Добавить(ОписаниеФорматаОтчета);
		КонецЕсли;
		
		Если Объект.ДоступноОткрытиеОтчетаВФорматеExcel Тогда
			ОписаниеФорматаОтчета = Новый Структура("type", "XLSX");
			НастройкиОтчетов.formats.Добавить(ОписаниеФорматаОтчета);
		КонецЕсли;
		
		Если Объект.ДоступноОткрытиеОтчетаВКабинете Тогда
			ОписаниеФорматаОтчета = Новый Структура("type", "HTML5");
			НастройкиОтчетов.formats.Добавить(ОписаниеФорматаОтчета);
		КонецЕсли;
		
	КонецЕсли;
		
	НастройкиОбучения.Вставить("features", 
		Новый Структура("activities, news, communication, library, users, electronicResources, backendReports",
			НастройкиУчебныхАктивностей,
			НастройкиНовостей,
			НастройкиКоммуникаций,
			НастройкиБиблиотеки,
			НастройкиСтраницыПользователей,
			НастройкиКаталогаЭР,
			НастройкиОтчетов));
	
	НастройкиОбученияJSON = ОбщегоНазначенияСУ.ДанныеВJSON(НастройкиОбучения);

	ТекстФайлаНастроек = ТекстФайлаНастроек + "
	|oSettingsEdu = " + НастройкиОбученияJSON + ";";	
	
	//----------------------------------//
	
	// Настройки пользователей
	
	НастройкаПользователей = Новый Структура;
	
	НастройкаПользователей.Вставить("url", Объект.АдресСервисаПользователи); 
	НастройкаПользователей.Вставить("user", ЛогинСлужебногоПользователя(Объект)); 
	НастройкаПользователей.Вставить("password", ПарольСлужебногоПользователя(Объект)); 	
	
		НастройкиРегистрации = Новый Структура;
		НастройкиРегистрации.Вставить("available", Объект.ДоступнаСвободнаяРегистрация);
		НастройкиРегистрации.Вставить("placeToUp", Объект.РазместитьСсылкуРегистрацииСверху); 
		НастройкиРегистрации.Вставить("usePinCode", Объект.ИспользоватьПинКодыДляРегистрации);
		НастройкиРегистрации.Вставить("url", Объект.АдресСтраницыРегистрации); 
		
		ТаблицаПолейРегистрации = Новый ТаблицаЗначений;
		ТаблицаПолейРегистрации.Колонки.Добавить("id");
		ТаблицаПолейРегистрации.Колонки.Добавить("name");
		ТаблицаПолейРегистрации.Колонки.Добавить("typeInput");
		ТаблицаПолейРегистрации.Колонки.Добавить("required");
		ТаблицаПолейРегистрации.Колонки.Добавить("confirm");
		ТаблицаПолейРегистрации.Колонки.Добавить("typeValue");
		ТаблицаПолейРегистрации.Колонки.Добавить("variants");
		ТаблицаПолейРегистрации.Колонки.Добавить("confirmName");
		ТаблицаПолейРегистрации.Колонки.Добавить("description");
		ТаблицаПолейРегистрации.Колонки.Добавить("useAsLogin");
		
		Для каждого Строка Из Объект.ПоляРегистрации Цикл
		
			НоваяСтрока = ТаблицаПолейРегистрации.Добавить();
			НоваяСтрока.id = Строка.Имя;			
			НоваяСтрока.name = Строка.Наименование;
			НоваяСтрока.typeInput = Перечисления.ТипыПолейРегистрацииВебКабинетаСУО.ЗначениеДляВебКабинета(Строка.ТипПоля);
			НоваяСтрока.required = Строка.Обязательное;
			НоваяСтрока.confirm = Строка.ДобавлятьПолеПодтверждения;
			НоваяСтрока.confirmName = Строка.НаименованиеПодтверждения;
			НоваяСтрока.description = Строка.Описание;
			НоваяСтрока.useAsLogin = Строка.ИспользоватьКакЛогин;
			
			Если ЗначениеЗаполнено(Строка.Реквизит) Тогда
				
				ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Реквизит, "ТипЗначения");
				
				//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

				Если ТипРеквизита.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
					
					НоваяСтрока.typeValue = "values";
						
					ЗапросДанных = Новый Запрос;
					ЗапросДанных.Текст = 
						"ВЫБРАТЬ
						|	ЗначенияСвойствОбъектов.Ссылка КАК value,
						|	ЗначенияСвойствОбъектов.Наименование КАК name
						|ИЗ
						|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
						|ГДЕ
						|	ЗначенияСвойствОбъектов.Владелец = &Свойство
						|	И ЗначенияСвойствОбъектов.ПометкаУдаления = ЛОЖЬ
						|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ";
					
					ЗапросДанных.УстановитьПараметр("Свойство", Строка.Реквизит);
					
					НоваяСтрока.variants = ЗапросДанных.Выполнить().Выгрузить();
					
				//----------------------------------//	
					
				ИначеЕсли ТипРеквизита.СодержитТип(Тип("Булево")) Тогда
					
					НоваяСтрока.typeValue = "boolean";
					НоваяСтрока.variants = NULL;
					
				ИначеЕсли ТипРеквизита.СодержитТип(Тип("Число")) Тогда
					
					НоваяСтрока.typeValue = "number";
					НоваяСтрока.variants = NULL;
					
				ИначеЕсли ТипРеквизита.СодержитТип(Тип("Дата")) Тогда
					
					НоваяСтрока.typeValue = "date";
					НоваяСтрока.variants = NULL;
					
					
				Иначе
					
					НоваяСтрока.typeValue = "string";
					НоваяСтрока.variants = NULL;

				КонецЕсли;					
				
				
			Иначе
				
				НоваяСтрока.typeValue = "string";
				НоваяСтрока.variants = NULL;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НастройкиРегистрации.Вставить("form", ТаблицаПолейРегистрации);
		
		
		НастройкиВосстановленияПароля = Новый Структура;
		НастройкиВосстановленияПароля.Вставить("available", Объект.ДоступноВосстановлениеПароля); 
		НастройкиВосстановленияПароля.Вставить("url", Объект.АдресСтраницыВосстановленияПароля); 
		
		НастройкиАутентификации = Новый Структура;
		
			НастройкиСтандартнойАутентификации = Новый Структура;
			НастройкиСтандартнойАутентификации.Вставить("available", Объект.ДоступнаСтандартнаяАутентификация);
			
			НастройкиПоляЛогин = Новый Структура;
			НастройкиПоляЛогин.Вставить("title", Объект.НаименованиеПоляИмя);
			НастройкиПоляЛогин.Вставить("description", Объект.ОписаниеПоляИмя);
			НастройкиПоляЛогин.Вставить("placeholder", Объект.ОбразецЗаполненияПоляИмя);

			НастройкиСтандартнойАутентификации.Вставить("login", НастройкиПоляЛогин);
			
			НастройкиCASАутентификации = Новый Структура;
			НастройкиCASАутентификации.Вставить("available", Объект.ДоступнаАутентификацияCAS);
			НастройкиCASАутентификации.Вставить("url", Объект.АдресСервераCAS);
			НастройкиCASАутентификации.Вставить("service", Объект.ИмяСервисаCAS);
			НастройкиCASАутентификации.Вставить("name", Объект.ИмяСервераCAS);
			НастройкиCASАутентификации.Вставить("icon", Объект.ИконкаСервераCAS);
			
			НастройкиOpenIDАутентификации = Новый Структура;
			НастройкиOpenIDАутентификации.Вставить("available", Объект.ДоступнаАутентификацияOpenID);
			НастройкиOpenIDАутентификации.Вставить("provider", Объект.АдресПровайдераOpenID);
			НастройкиOpenIDАутентификации.Вставить("cancelAuthProvider", Объект.ОтменятьАутентификациюПровайдераOpenIDПриВыходе);
			НастройкиOpenIDАутентификации.Вставить("checkOnLoad", Объект.ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц);
			НастройкиOpenIDАутентификации.Вставить("name", Объект.ИмяПровайдераOpenID);
						
		НастройкиАутентификации.Вставить("standard", НастройкиСтандартнойАутентификации); 
		НастройкиАутентификации.Вставить("cas", НастройкиCASАутентификации); 
		НастройкиАутентификации.Вставить("openid", НастройкиOpenIDАутентификации); 
		
	НастройкаПользователей.Вставить("features", Новый Структура("registration, restore, authentication", НастройкиРегистрации, НастройкиВосстановленияПароля, НастройкиАутентификации));
	
		
	НастройкиСтатистики = Новый Структура;
	НастройкиСтатистики.Вставить("available", ЗначениеЗаполнено(Объект.ЧастотаСбораСтатистики));
	НастройкиСтатистики.Вставить("periodicity", Объект.ЧастотаСбораСтатистики);
	
	НастройкаПользователей.Вставить("statistics", НастройкиСтатистики);

	
	НастройкаПользователейJSON = ОбщегоНазначенияСУ.ДанныеВJSON(НастройкаПользователей);

	ТекстФайлаНастроек = ТекстФайлаНастроек + "
		|oSettingsUsers = " + НастройкаПользователейJSON + ";";		
	
	// Настройки электронных ресурсов
	
	НастройкиЭР = Новый Структура;
	
	НастройкиЭР.Вставить("displaySearch", Объект.ИспользоватьПоискПоЭлектроннымРесурсам);	
	
	НастройкиЭР.Вставить("url", Объект.АдресСервисаЭР); 
	НастройкиЭР.Вставить("user", ЛогинСлужебногоПользователя(Объект)); 
	НастройкиЭР.Вставить("password", ПарольСлужебногоПользователя(Объект)); 
	
	НастройкиЭР.Вставить("wsURL", Объект.АдресВебСервисаЭР); 
	НастройкиЭР.Вставить("wsUsername", ЛогинСлужебногоПользователя(Объект)); 
	НастройкиЭР.Вставить("wsPassword", ПарольСлужебногоПользователя(Объект)); 
	
	НастройкиЭРJSON = ОбщегоНазначенияСУ.ДанныеВJSON(НастройкиЭР);

	ТекстФайлаНастроек = ТекстФайлаНастроек + "
	|oSettingsRes = " + НастройкиЭРJSON + ";";			
	
	// Настройки электронных курсов
	
	НастройкиЭК = Новый Структура;
	Если ЗначениеЗаполнено(Объект.АдресСервисаЭлектронныхКурсов) Тогда
		НастройкиЭК.Вставить("url", Объект.АдресСервисаЭлектронныхКурсов); 
	Иначе
		НастройкиЭК.Вставить("url", Объект.АдресПубликацииИБ + "/hs/courses"); 
	КонецЕсли;
	НастройкиЭК.Вставить("user", ЛогинСлужебногоПользователя(Объект)); 
	НастройкиЭК.Вставить("password", ПарольСлужебногоПользователя(Объект));	
	
	НастройкиЭКJSON = ОбщегоНазначенияСУ.ДанныеВJSON(НастройкиЭК);

	
	ТекстФайлаНастроек = ТекстФайлаНастроек + "
		|oSettingsCourses = " + НастройкиЭКJSON + ";";			
	
	// Сохраняем файл настроек во временное ранилище
	
	ФайлНастроекТекстовыйДокумент = Новый ТекстовыйДокумент;
	ФайлНастроекТекстовыйДокумент.УстановитьТекст(ТекстФайлаНастроек);
	
	Если ПутьДляЗаписи = Неопределено Тогда
		
		ПутьКФайлуНастроек = ПолучитьИмяВременногоФайла("json");
		ФайлНастроекТекстовыйДокумент.Записать(ПутьКФайлуНастроек);	
		
		ФайлНастроекДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуНастроек);		
		АдресХранения = ПоместитьВоВременноеХранилище(ФайлНастроекДвоичныеДанные, УникальныйИдентификатор);
		
		Попытка
			УдалитьФайлы(ПутьКФайлуНастроек)
		Исключение			
		КонецПопытки;
		
		Возврат АдресХранения;
		
	Иначе
		
		СуществующийФайлНастроек = Новый Файл(ПутьДляЗаписи);
		
		Если СуществующийФайлНастроек.Существует() Тогда
			СуществующийТекстовыйДокумент = Новый ТекстовыйДокумент;
			СуществующийТекстовыйДокумент.Прочитать(ПутьДляЗаписи);
			СуществующийТекстНастроек = СуществующийТекстовыйДокумент.ПолучитьТекст();
			Если Найти(СуществующийТекстНастроек, Объект.Код) = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Возможно, в общем каталоге был установлен веб-кабинет из другой базы.
				|Если в каталоге нет других рабочих публикаций, то удалите файл настроек в нем и повторите операцию.'");
			КонецЕсли;
		КонецЕсли;
		
		ФайлНастроекТекстовыйДокумент.Записать(ПутьДляЗаписи);
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции

Функция АдресВебКабинета(ПубликацияВебКабинета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПубликацияВебКабинета = Неопределено Тогда
		ПубликацияВебКабинета = ОсновнаяПубликация();	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПубликацияВебКабинета) Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеПубликации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПубликацияВебКабинета, "АдресВебСервера, АдресКаталогаКабинета");
	
	Возврат ДанныеПубликации.АдресВебСервера + ДанныеПубликации.АдресКаталогаКабинета;
	
КонецФункции

Функция АдресКаталогаЭлектронныхРесурсов(ПубликацияВебКабинета = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ПубликацияВебКабинета = Неопределено Тогда
		ПубликацияВебКабинета = ОсновнаяПубликация();	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ПубликацияВебКабинета) Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеПубликации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПубликацияВебКабинета, "АдресВебСервера, АдресПубликацийРесурсов");
	
	Возврат ДанныеПубликации.АдресВебСервера + ДанныеПубликации.АдресПубликацийРесурсов;	
	
КонецФункции
	
Функция ОсновнаяПубликация(Знач Редакция = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнаяПубликацияИзКонстанты = ВебКабинетСУ.ПолучитьОсновнуюПубликациюИзКонстанты(Редакция);
	
	Если ЗначениеЗаполнено(ОсновнаяПубликацияИзКонстанты) Тогда
		Возврат ОсновнаяПубликацияИзКонстанты;
	Иначе
		Возврат ЕдинственнаяПубликацияИзСправочника(Редакция);
	КонецЕсли;
		
КонецФункции

Функция ЕстьПубликации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ";

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ЕстьПубликацииРедакции(Знач Редакция = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.ПометкаУдаления = ЛОЖЬ
		|	И ПубликацииВебКабинетаСУ.Редакция = &Редакция";
	
	Запрос.Параметры.Вставить("Редакция", 
		?(ЗначениеЗаполнено(Редакция), Редакция, ВебКабинетСУ.Редакция()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ЕдинственнаяПубликацияИзСправочника(Знач Редакция = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.ПометкаУдаления = ЛОЖЬ
		|	И ПубликацииВебКабинетаСУ.Редакция = &Редакция";
	
	Запрос.Параметры.Вставить("Редакция", 
		?(ЗначениеЗаполнено(Редакция), Редакция, ВебКабинетСУ.Редакция()));
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда		
		ВыборкаДетальныеЗаписи.Следующий();		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Функция ЕдинственнаяПубликацияВОбщемКаталоге(Знач Редакция = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнаяПубликация = ОсновнаяПубликация(Редакция);
	
	Если НЕ ЗначениеЗаполнено(ОсновнаяПубликация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеПубликации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнаяПубликация, "ЭтоЕдинственнаяПубликацияВОбщемКаталоге, ПометкаУдаления");
	
	Если ДанныеПубликации.ПометкаУдаления Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ДанныеПубликации.ЭтоЕдинственнаяПубликацияВОбщемКаталоге Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОсновнаяПубликация;
	
КонецФункции

Функция ДоступенПолныйКаталогПользователей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубликацииВебКабинетаСУ.Ссылка
		|ИЗ
		|	Справочник.ПубликацииВебКабинетаСУ КАК ПубликацииВебКабинетаСУ
		|ГДЕ
		|	ПубликацииВебКабинетаСУ.ДоступенПолныйКаталогПользователей = ИСТИНА
		|	И ПубликацииВебКабинетаСУ.ПометкаУдаления = ЛОЖЬ";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ЯзыкОсновнойПубликации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОсновнаяПубликация = Справочники.ПубликацииВебКабинетаСУ.ОсновнаяПубликация();
	
	ЯзыкИнтерфейса = Неопределено;
	
	Если ЗначениеЗаполнено(ОсновнаяПубликация) Тогда
		ЯзыкИнтерфейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяПубликация, "Язык");
	КонецЕсли;

	Возврат ЯзыкИнтерфейса;
	
КонецФункции

Функция ТаблицаРекомендуемыхОтчетов() Экспорт
	
	// Формируем таблицу рекомендуемых отчетов
		
	ТаблицаРекомендуемыхОтчетов = Новый ТаблицаЗначений;
	ТаблицаРекомендуемыхОтчетов.Колонки.Добавить("ПолноеИмяОтчета");
	ТаблицаРекомендуемыхОтчетов.Колонки.Добавить("КлючВарианта");
	ТаблицаРекомендуемыхОтчетов.Колонки.Добавить("НаименованиеВарианта");
	ТаблицаРекомендуемыхОтчетов.Колонки.Добавить("ДоступноКРазмещению");
	ТаблицаРекомендуемыхОтчетов.Колонки.Добавить("НомерГруппы");
	
	// 1.
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияОО";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты всех электронных обучений";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя;
	НоваяСтрока.НомерГруппы = 1;
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияСУО";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты всех электронных обучений";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя;
	НоваяСтрока.НомерГруппы = 1;
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияСУ";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты всех электронных обучений";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя;
	НоваяСтрока.НомерГруппы = 1;
	
	// 2.
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияОО";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты электронного обучения";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя;
	НоваяСтрока.НомерГруппы = 2;
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияСУО";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты электронного обучения";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя;
	НоваяСтрока.НомерГруппы = 2;
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.РезультатыОбученияСУ";
	НоваяСтрока.КлючВарианта = "ЗаданияОбучений";
	НоваяСтрока.НаименованиеВарианта = "Результаты электронного обучения";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.ОбучениеПреподавателя;
	НоваяСтрока.НомерГруппы = 2;
	
	// 3.
	
	НоваяСтрока = ТаблицаРекомендуемыхОтчетов.Добавить();
	НоваяСтрока.ПолноеИмяОтчета = "Отчет.ИспользованиеВебКабинетаСУ";
	НоваяСтрока.КлючВарианта = "ИспользованиеПользователямиПодробно";
	НоваяСтрока.НаименованиеВарианта = "Статистика использования веб-кабинета";
	НоваяСтрока.ДоступноКРазмещению = Перечисления.ВариантыРазмещенияОтчетовВебКабинетаСУО.СтраницаПреподавателя;			
	НоваяСтрока.НомерГруппы = 3;
	
	Возврат ТаблицаРекомендуемыхОтчетов;
	
КонецФункции

Функция НаименованиеРекомендуемогоОтчета(ВариантОтчета, Размещение)
	
	ТребуемыеДанные = Новый Структура("ПолноеИмя, КлючВарианта, Наименование", "Отчет.ПолноеИмя", "КлючВарианта", "Наименование");
	ДанныеВарианта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВариантОтчета, ТребуемыеДанные);
	ТаблицаОтчетов = ТаблицаРекомендуемыхОтчетов();
	
	ДанныеСтроки = ТаблицаОтчетов.НайтиСтроки(Новый Структура("ПолноеИмяОтчета, КлючВарианта, ДоступноКРазмещению", ДанныеВарианта.ПолноеИмя, ДанныеВарианта.КлючВарианта, Размещение));
	
	Если ДанныеСтроки.Количество() = 0 Тогда
		Возврат ДанныеВарианта.Наименование;	
	КонецЕсли;
	
	Возврат ДанныеСтроки[0].НаименованиеВарианта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЛогинСлужебногоПользователя(Объект)
	
	Если Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		Возврат "";
	Иначе
		Возврат Объект.ЛогинСлужебногоПользователя;
	КонецЕсли;
	
КонецФункции

Функция ПарольСлужебногоПользователя(Объект)
	
	Если Объект.СлужебныйПользовательУказанВПубликацииИнформационнойБазы Тогда
		Возврат "";
	Иначе
		Возврат Объект.ПарольСлужебногоПользователя;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
